benchmarks/n_0508_1.txt
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workload1 -p rocksdb.dir=/users/cc4351/test -threads 16 -replicator_addr 128.110.153.185:50050 -replicator_batch_size 10
Set replicator_addr to 128.110.153.185:50050
Set replicator batch size to 10
communicating with replicator at 128.110.153.185:50050
recvCount: 18750 met target
returned from latch for thread 54
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 23
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 56
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 26
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 58
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 42
recvCount: 18750 met target
recvCount: 18750 met target
returned from latch for thread 64
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 59
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 30
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 69
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 46
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 38
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 57
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 33
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 70
recvCount: 18750 met target
recvCount: 18750 met target
recvCount: 18750 met target
[...]
returned from latch for thread 50
[OVERALL], RunTime(ms), 6611
[OVERALL], Throughput(ops/sec), 45378.91393132658
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 411
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 6.216911208591741
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 411
[TOTAL_GC_TIME_%], Time(%), 6.216911208591741
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 213.25
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 3311
[CLEANUP], 95thPercentileLatency(us), 10
[CLEANUP], 99thPercentileLatency(us), 3311
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 297.83738666666665
[INSERT], MinLatency(us), 3
[INSERT], MaxLatency(us), 5275647
[INSERT], 95thPercentileLatency(us), 39
[INSERT], 99thPercentileLatency(us), 231
[INSERT], Return=OK, 300000
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workload1 -p rocksdb.dir=/users/cc4351/test -threads 16 -replicator_addr 128.110.153.185:50050 -replicator_batch_size 10
Set replicator_addr to 128.110.153.185:50050
Set replicator batch size to 10
communicating with replicator at 128.110.153.185:50050